[
  {

    "name": "Ayon Jodder",
    "date": "13th June, 2019",
    "image": "https://cdn.pixabay.com/photo/2014/07/09/10/04/man-388104_960_720.jpg",
    "blogHeading": "Difference between javascript and nodejs",
    "blog": "Javascript is a computer language that is used to create web-based scripts. It is only compatible with browsers. It is almost exclusively utilized on the client side. It is capable of adding HTML and manipulating the DOM. It is compatible with any browser engine, including Safari's JS core and Firefox's Spidermonkey. On the other side, NodeJS is a runtime environment for Javascript. With the aid of NodeJS, we can execute Javascript outside of the browser. It is mostly utilized at the server level. Nodejs does not support the addition of HTML tags. V8 is the node.js Javascript engine that parses and executes Javascript.",
    "blogImage": "https://www.javaassignmenthelp.com/blog/wp-content/uploads/2022/01/javascript-vs-nodejs.webp"
  },
  {
    "name": "Sabbir Mahmud",
    "date": "17th July, 2020",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTfuSTDCkFtxG2yl9qDYnHEwV6vF6Y9hkbiuzLmOaVoO_jupwImy1-NmP_kd8LiPzaimI8&usqp=CAU",
    "blogHeading": "When should you use nodejs and when should you use mongodb",
    "blog" : "Non-blocking, event-driven servers are the primary use cases for Node. js. Despite the fact that it may be used for both normal web pages and API services, it was designed for real-time push-based systems. Node.js' scalability makes it easy to build programs that can expand with your business. Microservices design or containerization, where scalability and flexibility can be achieved quickly and easily without losing speed, is a great fit for Node.js. On the other side, MongoDB which is a NoSQL database, is an excellent option when your data is document-centric and doesn't fit well into the schema of a relational database, when you need to support vast size, when you are fast prototyping, and for a few additional use cases.Because NoSQL databases are designed to grow horizontally across several servers, they are excellent at managing large amounts of data. With MongoDB's built-in sharding capability, developers can extend clusters simply by adding computers, which is straightforward and fast in a cloud context. It's a more cost-effective solution than corporations previously had available, when they had to provide their data centers with adequate server storage and CPU resources for the peak usage cycles, leaving systems unused when loads reduced.",
    "blogImage": "https://i.morioh.com/1f14860de0.png"
  },

  {
    "name": "Ashraful Islam",
    "date": "26th April, 2018",
    "image": "https://st.depositphotos.com/1008939/1880/i/600/depositphotos_18807295-stock-photo-portrait-of-handsome-man.jpg",
    "blogHeading": "Differences between sql and nosql databases",
    "blog": "SQL databases have a predefined schema that is either static or fixed. These databases are unsuitable for storing data in a hierarchical structure. These databases are your best option if you have a challenging search. Vertical scaling of SQL databases is conceivable. On the other hand, NoSQL databases are dynamic in structure. These databases are the best choice for storing data in a hierarchical structure. These databases aren't the greatest for complex queries. NoSQL databases provide horizontal scalability.",
    "blogImage": "https://miro.medium.com/max/720/1*ay9nx1XdZ3AOzx5Ev8xJEg.png"
  },
  {
    "name": "Ashraful Islam",
    "date": "26th April, 2018",
    "image": "https://st.depositphotos.com/1008939/1880/i/600/depositphotos_18807295-stock-photo-portrait-of-handsome-man.jpg",
    "blogHeading": "What is the purpose of jwt and how does it work",
    "blog": "JWT (JSON Web Token) is an open standard that facilitates secure communication between a client and server. JWTs are signed using a cryptographic technique in order to ensure that their claims can never be modified once they have been issued. Unlike other web tokens, JWT is composed of a list of claims. After decoding, two JSON strings will be produced: a header and a payload. This package's payload consists of insurance claims. JSON strings of 12 fields are used to make the JWT compact. In most cases, this data is utilized by the server to determine whether or not a user has the necessary permissions to do the requested action. The signature verifies the token's authenticity. Using the token, a recipient may verify that a signature matches both the document's header and its content.",
    "blogImage": "https://www.devonblog.com/wp-content/uploads/2018/08/jwt_05.jpg"
  }
]
